---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Invalid
enum: Autodesk.Revit.DB.Structure.AnalyticalProjectionType
source: html/7b5de664-1e5e-8097-e5f6-a6d063f23612.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Invalid

Set to a bad setting. Should only be set at this very rarely (i.e., at initial creation).